tests/fixtures/stripe/subscription.create.success.json

{
  "id": "sub_EuRj5ucMHxLYCz",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1555603897,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "created": 1555603897,
  "current_period_end": 1587226297,
  "current_period_start": 1555603897,
  "customer": "cus_EuRjdBhqfj5bLW",
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "discount": null,
  "ended_at": null,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_EuRjr8TkXj6vJI",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1555603898,
        "metadata": [],
        "plan": {
          "id": "Plan-1",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 0,
          "billing_scheme": "per_unit",
          "created": 1555603896,
          "currency": "eur",
          "interval": "year",
          "interval_count": 1,
          "livemode": false,
          "metadata": [],
          "name": "sapiente",
          "nickname": null,
          "product": "et-delectus-repudiandae-ipsam",
          "statement_descriptor": null,
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "subscription": "sub_EuRj5ucMHxLYCz"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "\/v1\/subscription_items?subscription=sub_EuRj5ucMHxLYCz"
  },
  "latest_invoice": "in_1EQcpqADEVbkzKpD0YCWKiEt",
  "livemode": false,
  "metadata": [],
  "plan": {
    "id": "Plan-1",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 0,
    "billing_scheme": "per_unit",
    "created": 1555603896,
    "currency": "eur",
    "interval": "year",
    "interval_count": 1,
    "livemode": false,
    "metadata": [],
    "name": "sapiente",
    "nickname": null,
    "product": "et-delectus-repudiandae-ipsam",
    "statement_descriptor": null,
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start": 1555603897,
  "status": "active",
  "tax_percent": null,
  "trial_end": null,
  "trial_start": null
}